In [1]:
import numpy as np
import pandas as pd

In [2]:
#DateFrame, serilerin yan yana gelmesinden oluşturulmuş excel tablosu olarak düşünülebilir.

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.6879185 , -0.1188973 ,  0.49699233],
       [-0.06713685, -0.58424532,  0.21763857],
       [ 0.516575  , -0.4260945 , -0.61942021],
       [ 1.13708869,  0.00336621, -0.08953276]])

In [6]:
dataFrame = pd.DataFrame(data)

In [8]:
dataFrame

          0         1         2
0  0.687919 -0.118897  0.496992
1 -0.067137 -0.584245  0.217639
2  0.516575 -0.426095 -0.619420
3  1.137089  0.003366 -0.089533

In [17]:
yeniDataFrame = pd.DataFrame(data,index =["Mete","Fatih","Timur","Kaan"],columns=["Maaş","Yaş","Çalışma saati"])

In [18]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [21]:
yeniDataFrame["Yaş"]

Mete    -0.118897
Fatih   -0.584245
Timur   -0.426095
Kaan     0.003366
Name: Yaş, dtype: float64

In [22]:
yeniDataFrame[["Maaş","Yaş"]]

           Maaş       Yaş
Mete   0.687919 -0.118897
Fatih -0.067137 -0.584245
Timur  0.516575 -0.426095
Kaan   1.137089  0.003366

In [26]:
yeniDataFrame.loc ["Fatih"]

Maaş            -0.067137
Yaş             -0.584245
Çalışma saati    0.217639
Name: Fatih, dtype: float64

In [27]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [33]:
yeniDataFrame ["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"]

In [35]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati  Emeklilik Yaşı
Mete   0.687919 -0.118897       0.496992       -0.237795
Fatih -0.067137 -0.584245       0.217639       -1.168491
Timur  0.516575 -0.426095      -0.619420       -0.852189
Kaan   1.137089  0.003366      -0.089533        0.006732

In [36]:
yeniDataFrame.drop("Emeklilik Yaşı",axis = 1)

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [37]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati  Emeklilik Yaşı
Mete   0.687919 -0.118897       0.496992       -0.237795
Fatih -0.067137 -0.584245       0.217639       -1.168491
Timur  0.516575 -0.426095      -0.619420       -0.852189
Kaan   1.137089  0.003366      -0.089533        0.006732

In [38]:
yeniDataFrame.drop("Emeklilik Yaşı", axis =1, inplace=True)

In [39]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [41]:
yeniDataFrame.loc["Mete"]["Yaş"]

-0.11889730448594195

In [42]:
yeniDataFrame.loc["Timur","Yaş"]

-0.4260945028585283

In [43]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [44]:
yeniDataFrame<0

        Maaş    Yaş  Çalışma saati
Mete   False   True          False
Fatih   True   True          False
Timur  False   True           True
Kaan   False  False           True

In [47]:
yeniDataFrame[yeniDataFrame["Yaş"]>0]

          Maaş       Yaş  Çalışma saati
Kaan  1.137089  0.003366      -0.089533

In [48]:
yeniDataFrame[yeniDataFrame["Maaş"]<0]

           Maaş       Yaş  Çalışma saati
Fatih -0.067137 -0.584245       0.217639

In [49]:
#indeks değiştirme

In [50]:
yeniDataFrame.reset_index()

   index      Maaş       Yaş  Çalışma saati
0   Mete  0.687919 -0.118897       0.496992
1  Fatih -0.067137 -0.584245       0.217639
2  Timur  0.516575 -0.426095      -0.619420
3   Kaan  1.137089  0.003366      -0.089533

In [51]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati
Mete   0.687919 -0.118897       0.496992
Fatih -0.067137 -0.584245       0.217639
Timur  0.516575 -0.426095      -0.619420
Kaan   1.137089  0.003366      -0.089533

In [52]:
yeniIndeksListesi = ["Met","Fat","Tim","Kaa"]

In [55]:
yeniDataFrame ["Yeni Indeks"] = yeniIndeksListesi

In [56]:
yeniDataFrame

           Maaş       Yaş  Çalışma saati Yeni Indeks
Mete   0.687919 -0.118897       0.496992         Met
Fatih -0.067137 -0.584245       0.217639         Fat
Timur  0.516575 -0.426095      -0.619420         Tim
Kaan   1.137089  0.003366      -0.089533         Kaa

In [59]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [60]:
yeniDataFrame

                 Maaş       Yaş  Çalışma saati
Yeni Indeks
Met          0.687919 -0.118897       0.496992
Fat         -0.067137 -0.584245       0.217639
Tim          0.516575 -0.426095      -0.619420
Kaa          1.137089  0.003366      -0.089533